app/controllers/contacts_controller.rb

    def create
        @contact = Contact.new(contact_params)
        # if @contact.valid?
        #     @contact.save
        #     redirect_to contacts_path
        # else
        #     render 'new'
        # end
        if @contact.validate
            @contact.save
---
INSERT INTO "contacts" ("title", "user_name", "address", "created_at", "updated_at", "phone", "first_name", "last_name") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def update
        @contact = Contact.find(params[:id])
        @contact.update(contact_params)
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "contacts" SET "title" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["title", "Ms"], ["updated_at", "2023-10-12 12:47:22.149704"], ["id", 4]]

    def destroy
        puts "Inside destroy"
        @contact = Contact.find(params[:id])
        @contact.destroy
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "contacts" WHERE "contacts"."id" = ?  [["id", 9]]